#include <main-proteus.h>
#include <flex_lcd-proteus.h> // το h αρχείο του προγράμματος οδήγησης της οθόνης θα 
                     // πρέπει να είναι στον ίδιο φάκελο όπου θα αποθηκεύσουμε
                     //το πρόγραμμα μας
                     //θα πρέπει να γίνει έλεγχος και πιθανόν τροποποίηση 
                     // στις δηλώσεις #define LCD_DB4 PIN_B4 κλπ που
                     // υπάρχουν στην flex_lcd.c. Με αυτές τις
                    // δηλώσεις καθορίζεται σε ποιους ακροδέκτες του 
                     // μικροελεγκτή συνδέεται η οθόνη.

#byte PORTB=0xf81 // στην θέση 0xf81 είναι ο καταχωρητής δεδομένων 
                  //της πόρτας Β

void main() {

lcd_init();      // αρχικοποίηση της οθόνης

lcd_putc("\f"); // καθαρισμός της οθόνης

lcd_gotoxy(4,1); // η οθόνη θα εμφανίσει στην 4η θέση της 1ης γραμμής

lcd_putc("MICRO LAB"); // εμφανίζεται το μήνυμα στην θέση που 
            // ορίσθηκε από την προηγούμενη εντολή

while(TRUE){

lcd_gotoxy(5,2);  // η οθόνη θα εμφανίσει στην 5η θέση της 2ης γραμμής

lcd_putc("*****"); // εμφανίζονται οι αστερίσκοι στην θέση που καθορίστηκε
          // από την προηγούμενη εντολή

delay_ms(500);  // καθυστέρηση 500 χιλιοστά του δευτερολέπτου

lcd_gotoxy(5,2);  // η οθόνη θα εμφανίσει πάλι στην 5η θέση της 2ης γραμμής

lcd_putc("     ");  // γράφονται 5 κενοί χαρακτήρες εκεί όπου είχαν γραφεί
        // οι πέντε αστερίσκοι

delay_ms(500);  // αναμονή για 500 ms

         } // κλείνει η αγκύλη του while(TRUE)

   } // κλείνει η αγκύλη του main


