#include <main.h> // Συμπεριλαμβάνουμε το αρχείο
                  // αρχικών ρυθμίσεων  main.h
#byte PORTB =0xF81 // αποδίδουμε στη θέση μνήμης 0xF81
                   // το όνομα PORTB
                   // Δηλαδή δημιουργούμε μια μεταβλητή
                   // των 8 bit της οποίας η τιμή θα
                   // αποθηκεύεται στη θέση μνήμης F81h
                   // Η θέση μνήμης F81h είναι ο καταχωρητής
                   // δεδομένων της πόρτας B 
                   
void main(void){

set_tris_b(0x00);  // κάνουμε την πόρτα B έξοδο
                   // Δηλαδή δίνουμε στον καταχωρητή κατεύθυνσης
                   // της πόρτας Β την τιμή 0000 0000

PORTB =0b11110000;       //Αποδίδουμε στον καταχωρητή δεδομένων
                   //της πόρτας Β την τιμή 1111 0000

     while(TRUE) {   // ατέρμων βρόχος
     
                  PORTB=0b11111111;    // Όλοι οι ακροδέκτες της πόρτας Β λαμβάνουν την τιμή 1
                  delay_ms(100);              // Kαθυστέρηση 100 ms           
                  PORTB=0b00000000;    // 'Ολοι οι ακροδέκτες της πόρτας Β λαμβάνουν την τιμή 0
                  delay_ms(100);              // Καθυστέρηση 100ms 
           
                 }
                 
               }    // κλείνει η αγκύλη της main()
               

