#include <main.h>
#byte PORTD=0xF83                                                              //F83 είναι η θέση τη καταχωρητή δεδομένων της πόρτας D
                                                                               // στην μνήμη του μικροελεγκτή
                                                                               // Δίνουμε στην διεύθυνση 0xF83 το όνομα PORTD
void init(void);
void ext_int1(void); 

void main()        {
init();
                                                                               //Ρουτίνα αρχικοποίησης, ρυθμίσεις εισόδων/εξόδων, διακοπών                                                                          // κλπ.
while(TRUE){
            PORTD=0b11111111;                                                  //Με τις τέσσερις αυτές εντολές μέσα στην while(TRUE) αναβοσβήνουν
            delay_ms(100);                                                     //τα LED που συνδέονται στην πόρτα Β
            PORTD=0b00000000;
            delay_ms(100);
            }                                                                  //Το κύριο πρόγραμμα δεν κάνει τίποτα
                   }                                                           //Κλείνει η αγκύλη της main
                   
void init(){                                                                   //Αρχή ρουτίνας καθορισμού αρχικών ρυθμίσεων
           set_tris_d(0x00);                                                   //Καθορισμός της πόρτας D ως έξοδος
           PORTD = 0b00000000;                                                 //Αρχική τιμή 0 στην πόρτας D
           
           ext_int_edge(1, H_TO_L);                                            //Ενεργοποίηση της διακοπής από RB1/INT1 κατά την 
                                                                               //μετάβαση από 1 σε 0(κατερχόμενο μέτωπο παλμού)
           enable_interrupts(GLOBAL);                                          //Ενεργοποίηση του γενικού διακόπτη
                                                                               //διακοπών
           enable_interrupts(INT_EXT1);                                        //Ενεργοποίηση διακοπών από τον
           }                                                                   // ακροδέκτη RB1

#INT_EXT1                                                                      //εξωτερική διακοπή που προκαλείται από αλλαγή κατάστασης
                                                                               //στο RB1/ΙΝΤ1
void ext_int1() {                                                              //Αρχή ρουτίνας διακοπής κινούμενης τελείας
                 PORTD=0b10000000;delay_ms(100);             
                 PORTD=0b01000000;delay_ms(100);
                 PORTD=0b00100000;delay_ms(100);  
                 PORTD=0b00100000;delay_ms(100);
                 PORTD=0b00010000;delay_ms(100);
                 PORTD=0b00001000;delay_ms(100);    
                 PORTD=0b00000100;delay_ms(100);  
                 PORTD=0b00000010;delay_ms(100);           
                 PORTD=0b00000001;delay_ms(100); 
                 PORTD=0b00000010;delay_ms(100);  
                 PORTD=0b00000100;delay_ms(100);
                 PORTD=0b00001000;delay_ms(100);
                 PORTD=0b00010000;delay_ms(100);
                 PORTD=0b00100000;delay_ms(100);
                 PORTD=0b01000000;delay_ms(100);
                 PORTD=0b10000000;delay_ms(100);
                }  
